In [45]:
import pandas as pd

In [46]:
data = pd.read_csv("datos.txt")

In [47]:
data

   Precio
0   $10.0
1   $11.1
2    $9.1
3   $10.9
4    $9.1
5  $10.11

In [55]:
def cleaningtxt(f):
    def new_function(*args, **kwargs):
        cadena = args[0]
        cadena = cadena.replace("$","")
        # print(cadena)
        return f(cadena, **kwargs)
    return new_function

In [56]:
@cleaningtxt
def precios_to_decimal(d):
    return float(d)

In [57]:
data['z'] = data['Precio'].apply(precios_to_decimal)

In [58]:
data

   Precio      z
0   $10.0  10.00
1   $11.1  11.10
2    $9.1   9.10
3   $10.9  10.90
4    $9.1   9.10
5  $10.11  10.11

In [59]:
@cleaningtxt
def micadena(d):
    return d

In [60]:
print(micadena("$hola mundo$"))

hola mundo